app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos"
---
  def index
    @photo = Photo.new
    @photos = Photo.all

INSERT INTO "photos" ("created_at", "picture", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-06-06 11:32:10.364783"], ["picture", ""], ["updated_at", "2015-06-06 11:32:10.364783"]]
---
  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save